<?php

class SubCategorieSeeder extends Seeder {


	public function run()
	{
  $subcat = array('1'=>  array("กล้องดิจิตอล","กล้องฟิลม์","กล้องวีดีโอ","กล้องวงจรปิด","กระเป๋ากล้อง","กล้องส่องทางไกล","อื่นๆ"),
'2'=>  array("เรียนพิเศษ","กวดวิชา","สอนภาษา","ศึกษาต่อต่างประเทศ","อบรมสัมนา","อื่นๆ"),
'3'=> array("กอล์ฟ","ฟุตบอล","เทนนิส","อุปกรณ์กีฬา","เครื่องออกกำลังกาย","ฟิตเนส","โยคะ","อื่นๆ") ,
'4'=>  array("เกมส์ออนไลน์","เกมส์คอมพิวเตอร์","ตลับ","แผ่นเกมส์","ของเล่น","ปืนอัดลม","เครื่องเล่นเกมส์อื่นๆ"),
 '5'=> array("พระเครื่อง","เหรียญ","ธนบัตร","แสตมป์","หนังสือ","การ์ด","งานศิลปะ","ของเล่น","ของสะสมจากภาพยนต์","อื่นๆ" ),
 '6'=> array("PC","โน๊ตบุ๊ค","พริ้นเตอร์","อินเทอร์เน็ต","Hosting","Web","Design","Software","อื่นๆ" ),
 '7'=> array("โทรทัศน์","เครื่องเล่น","VCD","DVD","เครื่องเสียง","เคเบิ้ล","แอร์","ตู้เย็น","เครื่องซักผ้า","เครื่องใช้ไฟฟ้าอื่นๆ"), 
 '8'=>  array("กีตาร์","กลอง","เครื่องเป่า","เปียโน","เครื่องดนตรีไทย","สอนดนตรี","ห้องซ้อม","เครื่องดนตรีอื่นๆ" ),
 '9'=>  array("สัตว์เลี้ยง","อาหารสัตว์","อุปกรณ์เลี้ยงสัตว์","โรงเรียนฝึกสัตว์เลี้ยง","ดอกไม้","พันธุ์ไม้","อุปกรณ์การเกษตร","อื่นๆ"),
  '10'=> array("ตั๋วเครื่องบิน","ตั๋วรถโดยสาร","รถไฟ","กีฬา","บัตรคอนเสิร์ต","ภาพยนตร์","คูปอง","อื่นๆ" ),
   '11'=> array( "ทัวร์ในประเทศ","ทัวร์ต่างประเทศ","โรงแรม","รีสอร์ท","ที่พัก","บริการรถเช่า","ดำน้ำ","พายเรือ","ตกปลา","อื่นๆ" ),
   '12'=>  array("งานประจำ","ธุรกิจเสริม","ขายตรง","MLM","ประกัน","บัตรเครดิต","สำนักบัญชี","กฎหมาย","นำเข้า","ส่งออก","อื่นๆ"),
    '13'=>array( "กระเป๋า","เข็มกลัด","เครื่องประดับ","จิวเวลลี่","นาฬิกา","น้ำหอม","รองเท้า","แว่นตา","แหวน","อื่นๆ" ),
    '14'=>  array("ภาพยนตร์","ซีรีส์","ละคร","รายการโทรทัศน์","เพลง","มิวสิควิดีโอ","อื่นๆ" ),
    '15'=>array( "เฟอร์นิเจอร์","ของตกแต่ง","ออกแบบ","ตกแต่งภายใน","พรม","ม่าน","วอลเปเปอร์","โคมไฟ","อื่นๆ" ),
    '16'=>  array("เสื้อผ้าบุรุษ","เสื้อผ้าสตรี","เสื้อผ้าเด็กชาย","เสื้อผ้าเด็กหญิง","ชุดนักเรียน","เครื่องแบบ","ชุดแต่งงาน","อื่นๆ"),
     '17'=>  array("มือถือ","อุปกรณ์เสริม","ซิมการ์ด","เบอร์สวย","PCT","วิทยุสื่อสารวิทยุสื่อสาร","PABX","ตู้สาขา","อุปกรณ์สื่อสารอื่นๆ"),
      '18'=>  array("เนอส์เซอรี่","รับเลี้ยงเด็ก","ผลิตภัณฑ์เด็ก","ผลิตภัณฑ์สำหรับแม่","อื่นๆ" ),
      '19'=> array("รถเก๋ง","รถกระบะ","รถตู้","รถจักรยานยนต์","อะไหล่","เครื่องเสียง","ประดับยนต์","ทะเบียนสวย","อื่นๆ" ),
      '20'=>  array("การ์ด","งานหัตกรรม","เย็บปักถักร้อย","ของพรีเมี่ยม","ของชำร่วย","ของกิ๊ฟชอป","ร้านดอกไม้","อื่นๆ"), 
      '21'=>array( "ลดความอ้วน","ผลิตภัณฑ์เพื่อสุขภาพ","อุปกรณ์เสริมสวย","สมุนไพร","สปา","สถานเสริมความงาม","อื่นๆ" ),
      '22'=> array("เรื่องสั้น","การ์ตูน","นวนิยาย","นิทาน","นิตยสาร","แค๊ตตาล๊อก","ตำราเรียน","หนังสือทั่วไป","อื่นๆ"),
        '23'=>array( "บ้านเดี่ยว","ทาวน์เฮาส์","ตึกแถว","คอนโดมิเนียม","ห้องพัก","ที่ดิน","อื่นๆ"),
        '24'=>  array("อาหารคาว","ขนม","เครื่องดื่ม","อาหารสด","แห้ง","เครื่องปรุง","อุปกรณ์ทำอาหาร","ร้านอาหาร","อื่นๆ"),
         '25'=> array("เครื่องจักร","วัตถุดิบ","วัสดุ","เคมีภัณฑ์","บรรจุภัณฑ์","การออกแบบ","อื่นๆ"),
          '26'=> array( "เครื่องเขียน","เฟอร์นิเจอร์สำนักงาน","เครื่องถ่ายเอกสาร","Fax","เครื่องตอกบัตร","อื่นๆ"), 
          '27'=> array("รับจ้าง","โฆษณา","การตลาด","โปรโมทเว็บ","ประชาสัมพันธ์สินค้า" ));
	   
		$date = new DateTime;
		foreach ($subcat as $key => $value) {
	foreach ($value as  $val) {
		$category = array();
		$category = array(
			'name'      =>  $val,
			'created_at' => $date->modify('-15 day'),
			'updated_at' => $date->modify('-7 day'),
			'categorie_id' => $key,
		);
		SubCategorie::insert($category);
			}
			
		}
		



		// Delete all the blog posts

		// Insert the blog posts
		// SubCategorie::insert($category);
	}

}
	
	


	


	




	


	


	





	

